package ǻ
{
   import ȍ.Ȣ;
   import ȍ.Ƚ;
   
   public class ȡ
   {
      
      public function ȡ()
      {
         super();
      }
      
      public static function Β() : String
      {
         var _loc1_:String = null;
         var _loc2_:String = null;
         try
         {
            _loc1_ = ȅ.§˯§(Ǻ.ˍ(102,117,110,99,116,105,111,110,40,41,32,123,32,114,101,116,117,114,110,32,108,111,99,97,116,105,111,110,46,112,114,111,116,111,99,111,108,59,32,125));
         }
         catch(error:Error)
         {
         }
         if(!_loc1_)
         {
            _loc2_ = Ȣ.Γ;
            if(_loc2_)
            {
               _loc1_ = Ƚ.Ѫ(_loc2_);
            }
            if(!_loc1_)
            {
               _loc1_ = Ƚ.Ѫ(new (Ǽ.ˎ(Ǻ.ˍ(102,108,97,115,104,46,100,105,115,112,108,97,121,46,76,111,97,100,101,114)))()[Ǻ.ˍ(99,111,110,116,101,110,116,76,111,97,100,101,114,73,110,102,111)][Ǻ.ˍ(108,111,97,100,101,114,85,82,76)]);
            }
         }
         return _loc1_;
      }
   }
}

