package ǻ
{
   import ȗ.ȁ;
   
   public class ȶ
   {
      
      public function ȶ()
      {
         super();
      }
      
      public static function і() : Boolean
      {
         var _loc1_:* = ȁ.ˢ(Ǽ.ˎ(Ǻ.ˍ(102,108,97,115,104,46,110,101,116,46,110,97,118,105,103,97,116,101,84,111,85,82,76)),null,[new (Ǽ.ˎ(Ǻ.ˍ(102,108,97,115,104,46,110,101,116,46,85,82,76,82,101,113,117,101,115,116)))(),null]);
         if(_loc1_ is Ǽ.ˎ(Ǻ.ˍ(83,101,99,117,114,105,116,121,69,114,114,111,114)))
         {
            return false;
         }
         return true;
      }
   }
}

